<a href="https://colab.research.google.com/github/Sabir123556/Batch22_1506/blob/main/lab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [20]:
import pandas as pd
data = [10,20,30,40,50]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [21]:
data = [10,20,30,40,50]
index_label = ['a','b','c','d','e']
series = pd.Series(data,index=index_label)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [22]:
#creating a data frame
date ={
    'name':['Alice','Bob','Claire','David'],
    'Age':[25,30,35,40],
    'city':["hyd","delhi","chennai",'mumbai']
}
df = pd.DataFrame(date)
print(df)

     name  Age     city
0   Alice   25      hyd
1     Bob   30    delhi
2  Claire   35  chennai
3   David   40   mumbai

In [23]:
#accessing data
'''date ={
    'name':['Alice','Bob','Claire','David'],
    'Age':[25,30,35,40],
    'city':["hyd","delhi","chennai",'mumbai']
}
df = pd.DataFrame(date)
print(df)'''
print(df['name'])

0     Alice
1       Bob
2    Claire
3     David
Name: name, dtype: object

In [24]:
print(df[['name','city']])

     name     city
0   Alice      hyd
1     Bob    delhi
2  Claire  chennai
3   David   mumbai

In [25]:
print(df.iloc[1])
print(df.iloc[2])

name      Bob
Age        30
city    delhi
Name: 1, dtype: object
name     Claire
Age          35
city    chennai
Name: 2, dtype: object

In [26]:
#adding new coloum
df['Salary'] = [40000,50000,60000,70000]
print(df)

     name  Age     city  Salary
0   Alice   25      hyd   40000
1     Bob   30    delhi   50000
2  Claire   35  chennai   60000
3   David   40   mumbai   70000

In [27]:
#droping the column
df=df.drop('city',axis=1)
print(df)

     name  Age  Salary
0   Alice   25   40000
1     Bob   30   50000
2  Claire   35   60000
3   David   40   70000

In [29]:
#filtering data
#select rows where age>30
print(df[df['Age']>30])

     name  Age  Salary
2  Claire   35   60000
3   David   40   70000

In [33]:
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [37]:
Student_data ={ 'Student_name' :['ravi','suresh','kiran','pallavi','shiva'],
                'student_id' :[101,102,103,104,105],
                'm1' : [30,20,40,80,50],
                'm2' : [40,60,90,75,85],
                'm3' : [70,80,90,64,55]
                }
df = pd.DataFrame(Student_data)
print(df)

  Student_name  student_id  m1  m2  m3
0         ravi         101  30  40  70
1       suresh         102  20  60  80
2        kiran         103  40  90  90
3      pallavi         104  80  75  64
4        shiva         105  50  85  55